Autodesk.Revit.DB.Structure.RebarCoupler.GetCouplerQuantity
Identifies the number of couplers in a set.
Returns:
Returns the number of couplers in a set.
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets this rebar coupler element to be shown unobscured in a view.
view:
The view element
unobscured:
True if rebar coupler is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar coupler element doesn't have valid visibility data
Since:
2018.3

Autodesk.Revit.DB.Structure.RebarCoupler.IsUnobscuredInView(Autodesk.Revit.DB.View)
Checks if this rebar coupler element is shown unobscured in a view.
view:
The view element
Returns:
True if rebar coupler is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar coupler element doesn't have valid visibility data
Since:
2018.3

Autodesk.Revit.DB.Structure.RebarCoupler.GetCouplerPositionTransform(System.Int32)
Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set.
couplerPositionIndex:
An index between 0 and (CouplerQuantity-1).
Returns:
Returns a transformation that is composed from :
- a translation from (0, 0, 0) to coupler origin
- a rotation that will align the coupler with the bar segment on which it stays.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
couplerPositionIndex is not in the range [ 0, CouplerQuantity-1 ].
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.GetPointsForPlacement
gets the point (or points in case of rebar set) where the coupler is placed
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.GetCoupledReinforcementData
gets the reinforcement data. The returned list will have size = 2. If coupler stays on only one bar one element in this list will be null.
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.CouplerLinkTwoBars
returns true if the coupler sits on two rebar and false otherwise
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.ReinforcementData,Autodesk.Revit.DB.Structure.ReinforcementData,Autodesk.Revit.DB.Structure.RebarCouplerError@)
Creates a new instance of a Rebar Coupler element within the project.
doc:
A document.
typeId:
type id for coupler
pFirstData:
information about the first reinforcement to be coupled
pSecondData:
information about the second reinforcement to be coupled;
if a nullptr is passed in the coupler is placed on one reinforcement
error:
will be ValidationSuccesfully(0) if ok, otherwise the failure reason
Returns:
The newly created Rebar Coupler instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.CouplerMark
gets and sets the coupler mark
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler
Represents a rebar coupler element in Autodesk Revit.
Since:
2017